Ginger/GingerCoreNETUnitTest/TestResources/XML/stock.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
      <ubiNum>10000</ubiNum>
    </NumberToWords>
  </soap:Body>
</soap:Envelope>